cmsis-svd/cmsis-svd/data/Nuvoton/NANO103AE_v1.svd
       <register>
          <name>PWM0_CNTCLR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM0_CNTCLR</displayName>
          <description>PWM0 Clear Counter Register</description>
          <addressOffset>0x24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNTCLR0</name>
              <description>Clear PWM0 Counter Control Bit 0\nIt is automatically cleared by hardware.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Clear 16-bit PWM0 counter to 0000H</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CNTCLR2</name>
              <description>Clear PWM0 Counter Control Bit 2\nIt is automatically cleared by hardware.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Clear 16-bit PWM0 counter to 0000H</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CNTCLR4</name>
              <description>Clear PWM0 Counter Control Bit 4\nIt is automatically cleared by hardware.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Clear 16-bit PWM0 counter to 0000H</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PWM0_PERIOD0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM0_PERIOD0</displayName>
          <description>PWM0 Period Register 0</description>
          <addressOffset>0x30</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PERIOD</name>
              <description>PWM0 Period Register\nUp-Count mode: In this mode, PWM0 counter counts from 0 to PERIOD, and restarts from 0.\nDown-Count mode: In this mode, PWM0 counter counts from PERIOD to 0, and restarts from PERIOD.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PWM0_PERIOD0">
          <name>PWM0_PERIOD2</name>
          <displayName>PWM0_PERIOD2</displayName>
          <description>PWM0 Period Register 2</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register derivedFrom="PWM0_PERIOD0">
          <name>PWM0_PERIOD4</name>
          <displayName>PWM0_PERIOD4</displayName>
          <description>PWM0 Period Register 4</description>
          <addressOffset>0x40</addressOffset>
       </register>
       <register>
          <name>PWM0_CMPDAT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM0_CMPDAT0</displayName>
          <description>PWM0 Comparator Register 0</description>
          <addressOffset>0x50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMPDAT</name>
              <description>PWM0 Comparator Register\nCMPDAT use to compare with CNTR to generate PWM0 waveform, interrupt and trigger ADC.\nIn independent mode, CMPDAT0~5 denote as 6 independent PWM0_CH0~5 compared point.\nIn complementary mode, CMPDAT0, 2, 4 denote as first compared point, and CMPDAT1, 3, 5 denote as second compared point for the corresponding 3 complementary pairs PWM0_CH0 and PWM0_CH1, PWM0_CH2 and PWM0_CH3, PWM0_CH4 and PWM0_CH5.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PWM0_CMPDAT0">
          <name>PWM0_CMPDAT1</name>
          <displayName>PWM0_CMPDAT1</displayName>
          <description>PWM0 Comparator Register 1</description>
          <addressOffset>0x54</addressOffset>
       </register>
       <register derivedFrom="PWM0_CMPDAT0">
          <name>PWM0_CMPDAT2</name>
          <displayName>PWM0_CMPDAT2</displayName>
          <description>PWM0 Comparator Register 2</description>
          <addressOffset>0x58</addressOffset>
       </register>
       <register derivedFrom="PWM0_CMPDAT0">
          <name>PWM0_CMPDAT3</name>
          <displayName>PWM0_CMPDAT3</displayName>
          <description>PWM0 Comparator Register 3</description>
          <addressOffset>0x5C</addressOffset>
       </register>
       <register derivedFrom="PWM0_CMPDAT0">
          <name>PWM0_CMPDAT4</name>
          <displayName>PWM0_CMPDAT4</displayName>
          <description>PWM0 Comparator Register 4</description>
          <addressOffset>0x60</addressOffset>
       </register>
       <register derivedFrom="PWM0_CMPDAT0">
          <name>PWM0_CMPDAT5</name>
          <displayName>PWM0_CMPDAT5</displayName>
          <description>PWM0 Comparator Register 5</description>
          <addressOffset>0x64</addressOffset>
       </register>
       <register>
          <name>PWM0_DTCTL0_1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM0_DTCTL0_1</displayName>
          <description>PWM0 Dead-Time Control Register 0_1</description>
          <addressOffset>0x70</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DTCNT</name>
              <description>Dead-time Counter (Write Protect)\nThe dead-time can be calculated from the following formula: \nNote:This register is write protected. Refer toSYS_REGLCTL register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTEN</name>
              <description>Enable Dead-time Insertion for PWM0 Pair (PWM0_CH0, PWM0_CH1)(PWM0_CH2, PWM0_CH3)(PWM0_CH4, PWM0_CH5)(Write Protect)\nDead-time insertion is only active when this PWM0 pair complementary mode is enabled. If dead- time insertion is inactive, the outputs of pin pair are complementary without any delay.\nNote:This register is write protected. Refer toSYS_REGLCTL register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Dead-time insertion Disabled on the pin pair</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Dead-time insertion Enabled on the pin pair</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DTCKSEL</name>
              <description>Dead-time Clock Select (Write Protect)\nNote:This register is write protected. Refer toREGWRPROT register.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Dead-time clock source from PWM0_CLKn</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Dead-time clock source from prescaler output</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PWM0_DTCTL0_1">
          <name>PWM0_DTCTL2_3</name>
          <displayName>PWM0_DTCTL2_3</displayName>
          <description>PWM0 Dead-Time Control Register 2_3</description>
          <addressOffset>0x74</addressOffset>
       </register>
       <register derivedFrom="PWM0_DTCTL0_1">
          <name>PWM0_DTCTL4_5</name>
          <displayName>PWM0_DTCTL4_5</displayName>
          <description>PWM0 Dead-Time Control Register 4_5</description>
          <addressOffset>0x78</addressOffset>
       </register>
       <register>
          <name>PWM0_CNT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM0_CNT0</displayName>
          <description>PWM0 Counter Register 0</description>
          <addressOffset>0x90</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>PWM0 Data Register(Read Only)\nUser can monitor CNTR to know the current value in 16-bit period counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIRF</name>
              <description>PWM0 Direction Indicator Flag (Read Only)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Counter is Down count</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Counter is UP count</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
