cmsis-svd/cmsis-svd/data/Nuvoton/NANO103AE_v1.svd
       <register derivedFrom="PWM0_FCAPDAT0">
          <name>PWM0_FCAPDAT1</name>
          <displayName>PWM0_FCAPDAT1</displayName>
          <description>PWM0 Falling Capture Data Register 1</description>
          <addressOffset>0x218</addressOffset>
       </register>
       <register derivedFrom="PWM0_RCAPDAT0">
          <name>PWM0_RCAPDAT2</name>
          <displayName>PWM0_RCAPDAT2</displayName>
          <description>PWM0 Rising Capture Data Register 2</description>
          <addressOffset>0x21C</addressOffset>
       </register>
       <register derivedFrom="PWM0_FCAPDAT0">
          <name>PWM0_FCAPDAT2</name>
          <displayName>PWM0_FCAPDAT2</displayName>
          <description>PWM0 Falling Capture Data Register 2</description>
          <addressOffset>0x220</addressOffset>
       </register>
       <register derivedFrom="PWM0_RCAPDAT0">
          <name>PWM0_RCAPDAT3</name>
          <displayName>PWM0_RCAPDAT3</displayName>
          <description>PWM0 Rising Capture Data Register 3</description>
          <addressOffset>0x224</addressOffset>
       </register>
       <register derivedFrom="PWM0_FCAPDAT0">
          <name>PWM0_FCAPDAT3</name>
          <displayName>PWM0_FCAPDAT3</displayName>
          <description>PWM0 Falling Capture Data Register 3</description>
          <addressOffset>0x228</addressOffset>
       </register>
       <register derivedFrom="PWM0_RCAPDAT0">
          <name>PWM0_RCAPDAT4</name>
          <displayName>PWM0_RCAPDAT4</displayName>
          <description>PWM0 Rising Capture Data Register 4</description>
          <addressOffset>0x22C</addressOffset>
       </register>
       <register derivedFrom="PWM0_FCAPDAT0">
          <name>PWM0_FCAPDAT4</name>
          <displayName>PWM0_FCAPDAT4</displayName>
          <description>PWM0 Falling Capture Data Register 4</description>
          <addressOffset>0x230</addressOffset>
       </register>
       <register derivedFrom="PWM0_RCAPDAT0">
          <name>PWM0_RCAPDAT5</name>
          <displayName>PWM0_RCAPDAT5</displayName>
          <description>PWM0 Rising Capture Data Register 5</description>
          <addressOffset>0x234</addressOffset>
       </register>
       <register derivedFrom="PWM0_FCAPDAT0">
          <name>PWM0_FCAPDAT5</name>
          <displayName>PWM0_FCAPDAT5</displayName>
          <description>PWM0 Falling Capture Data Register 5</description>
          <addressOffset>0x238</addressOffset>
       </register>
       <register>
          <name>PWM0_CAPIEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM0_CAPIEN</displayName>
          <description>PWM0 Capture Interrupt Enable Register</description>
          <addressOffset>0x250</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAPRIENn</name>
              <description>PWM0 Capture Rising Latch Interrupt Enable Bits\nEach bit n controls the corresponding PWM0 channel n.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Capture rising edge latch interrupt Disabled</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Capture rising edge latch interrupt Enabled</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPFIENn</name>
              <description>PWM0 Capture Falling Latch Interrupt Enable Bits\nEach bit n controls the corresponding PWM0 channel n.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Capture falling edge latch interrupt Disabled</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Capture falling edge latch interrupt Enabled</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PWM0_CAPIF</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM0_CAPIF</displayName>
          <description>PWM0 Capture Interrupt Flag Register</description>
          <addressOffset>0x254</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAPRIFn</name>
              <description>PWM0 Capture Rising Latch Interrupt Flag\nThis bit is writing 1 to clear. Each bit n controls the corresponding PWM0 channel n.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No capture rising latch condition happened</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Capture rising latch condition happened, this flag will be set to high</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPFIFn</name>
              <description>PWM0 Capture Falling Latch Interrupt Flag\nThis bit is writing 1 to clear. Each bit n controls the corresponding PWM0 channel n.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No capture falling latch condition happened</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Capture falling latch condition happened, this flag will be set to high</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PWM0_SELFTEST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM0_SELFTEST</displayName>
          <description>PWM0 Self-test Mode Enable</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
       <register>
          <name>PWM0_PBUF0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM0_PBUF0</displayName>
          <description>PWM0 PERIOD0 Buffer</description>
          <addressOffset>0x304</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PBUF</name>
              <description>PWM0 Period Register Buffer(Read Only)\nUsed as PERIOD active register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PWM0_PBUF0">
          <name>PWM0_PBUF2</name>
          <displayName>PWM0_PBUF2</displayName>
          <description>PWM0 PERIOD2 Buffer</description>
          <addressOffset>0x30C</addressOffset>
       </register>
       <register derivedFrom="PWM0_PBUF0">
          <name>PWM0_PBUF4</name>
          <displayName>PWM0_PBUF4</displayName>
          <description>PWM0 PERIOD4 Buffer</description>
          <addressOffset>0x314</addressOffset>
       </register>
       <register>
          <name>PWM0_CMPBUF0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM0_CMPBUF0</displayName>
          <description>PWM0 CMPDAT0 Buffer</description>
          <addressOffset>0x31C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMPBUF</name>
              <description>PWM0 Comparator Register Buffer(Read Only)\nUsed as CMP active register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PWM0_CMPBUF0">
          <name>PWM0_CMPBUF1</name>
          <displayName>PWM0_CMPBUF1</displayName>
          <description>PWM0 CMPDAT1 Buffer</description>
          <addressOffset>0x320</addressOffset>
       </register>
       <register derivedFrom="PWM0_CMPBUF0">
          <name>PWM0_CMPBUF2</name>
          <displayName>PWM0_CMPBUF2</displayName>
          <description>PWM0 CMPDAT2 Buffer</description>
          <addressOffset>0x324</addressOffset>
       </register>
       <register derivedFrom="PWM0_CMPBUF0">
          <name>PWM0_CMPBUF3</name>
          <displayName>PWM0_CMPBUF3</displayName>
          <description>PWM0 CMPDAT3 Buffer</description>
          <addressOffset>0x328</addressOffset>
       </register>
       <register derivedFrom="PWM0_CMPBUF0">
          <name>PWM0_CMPBUF4</name>
          <displayName>PWM0_CMPBUF4</displayName>
          <description>PWM0 CMPDAT4 Buffer</description>
          <addressOffset>0x32C</addressOffset>
       </register>
       <register derivedFrom="PWM0_CMPBUF0">
          <name>PWM0_CMPBUF5</name>
          <displayName>PWM0_CMPBUF5</displayName>
          <description>PWM0 CMPDAT5 Buffer</description>
          <addressOffset>0x330</addressOffset>
       </register>
       <register>
          <name>PWM0_VERSION</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PWM0_VERSION</displayName>
          <description>PWM0 RTL Design Version Number</description>
          <addressOffset>0xFFC</addressOffset>
          <access>read-only</access>
          <resetValue>0x02010000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
       </register>
